XML-SOAP-SERVER/requestId.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://manyroads.dev/customers">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCustomerByIdRequest>
            <gs:custId>1</gs:custId>
        </gs:getCustomerByIdRequest>
    </soapenv:Body>
</soapenv:Envelope>